apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_i2c.h
/****************************************************************************
 * arch/xtensa/src/esp32/hardware/esp32_i2c.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_I2C_H
#define __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_I2C_H

#define REG_I2C_BASE(i)         (DR_REG_I2C_EXT_BASE + (i) * 0x14000 )

#define I2C_SCL_LOW_PERIOD_OFFSET        (0x0)
#define I2C_SCL_LOW_PERIOD_REG(i)        (REG_I2C_BASE(i) + I2C_SCL_LOW_PERIOD_OFFSET)

/* I2C_SCL_LOW_PERIOD : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This register is used to configure the low level width of
 * SCL clock.
 */

#define I2C_SCL_LOW_PERIOD      0x00003FFF
#define I2C_SCL_LOW_PERIOD_M    ((I2C_SCL_LOW_PERIOD_V)<<(I2C_SCL_LOW_PERIOD_S))
#define I2C_SCL_LOW_PERIOD_V    0x3FFF
#define I2C_SCL_LOW_PERIOD_S    0

#define I2C_CTR_OFFSET          (0x0004)
#define I2C_CTR_REG(i)          (REG_I2C_BASE(i) + I2C_CTR_OFFSET)

/* I2C_CLK_EN : R/W ;bitpos:[8] ;default: 1'b0 ; */

/* Description: This is the clock gating control bit for reading or
 * writing registers.
 */

#define I2C_CLK_EN              (BIT(8))
#define I2C_CLK_EN_M            (BIT(8))
#define I2C_CLK_EN_V            0x1
#define I2C_CLK_EN_S            8

/* I2C_RX_LSB_FIRST : R/W ;bitpos:[7] ;default: 1'h0 ; */

/* Description: This bit is used to control the storage mode for received
 * data.
 * 1: receive data from most significant bit
 * 0: receive data from least significant bit
 */

#define I2C_RX_LSB_FIRST        (BIT(7))
#define I2C_RX_LSB_FIRST_M      (BIT(7))
#define I2C_RX_LSB_FIRST_V      0x1
#define I2C_RX_LSB_FIRST_S      7

/* I2C_TX_LSB_FIRST : R/W ;bitpos:[6] ;default: 1'b0 ; */

/* Description: This bit is used to control the sending mode for data need to
 * be send.
 * 1: receive data from most significant bit
 * 0: receive data from least significant bit
 */

#define I2C_TX_LSB_FIRST        (BIT(6))
#define I2C_TX_LSB_FIRST_M      (BIT(6))
#define I2C_TX_LSB_FIRST_V      0x1
#define I2C_TX_LSB_FIRST_S      6

/* I2C_TRANS_START : R/W ;bitpos:[5] ;default: 1'b0 ; */

/* Description: Set this bit to start sending data in txfifo. */

#define I2C_TRANS_START         (BIT(5))
#define I2C_TRANS_START_M       (BIT(5))
#define I2C_TRANS_START_V       0x1
#define I2C_TRANS_START_S       5

/* I2C_MS_MODE : R/W ;bitpos:[4] ;default: 1'b0 ; */

/* Description: Set this bit to configure the module as i2c master clear this
 * bit to configure the module as i2c slave.
 */

#define I2C_MS_MODE             (BIT(4))
#define I2C_MS_MODE_M           (BIT(4))
#define I2C_MS_MODE_V           0x1
#define I2C_MS_MODE_S           4

/* I2C_SAMPLE_SCL_LEVEL : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: Set this bit to sample data in SCL low level.
 * clear this bit to sample data in SCL high level.
 */

#define I2C_SAMPLE_SCL_LEVEL    (BIT(2))
#define I2C_SAMPLE_SCL_LEVEL_M  (BIT(2))
#define I2C_SAMPLE_SCL_LEVEL_V  0x1
#define I2C_SAMPLE_SCL_LEVEL_S  2

/* I2C_SCL_FORCE_OUT : R/W ;bitpos:[1] ;default: 1'b1 ; */

/* Description:
 * 1: normally output scl clock
 * 0: exchange the function of scl_o and scl_oe (scl_o is the original
 * internal output scl signal scl_oe is the enable bit for the internal
 * output scl signal)
 */

#define I2C_SCL_FORCE_OUT       (BIT(1))
#define I2C_SCL_FORCE_OUT_M     (BIT(1))
#define I2C_SCL_FORCE_OUT_V     0x1
#define I2C_SCL_FORCE_OUT_S     1

/* I2C_SDA_FORCE_OUT : R/W ;bitpos:[0] ;default: 1'b1 ; */

/* Description:
 * 1: normally output sda data
 * 0: exchange the function of sda_o and sda_oe (sda_o is the original
 * internal output sda signal sda_oe is the enable bit for the internal
 * output sda signal)
 */

#define I2C_SDA_FORCE_OUT       (BIT(0))
#define I2C_SDA_FORCE_OUT_M     (BIT(0))
#define I2C_SDA_FORCE_OUT_V     0x1
#define I2C_SDA_FORCE_OUT_S     0

#define I2C_SR_OFFSET           (0x0008)
#define I2C_SR_REG(i)           (REG_I2C_BASE(i) + I2C_SR_OFFSET)

/* I2C_SCL_STATE_LAST : RO ;bitpos:[30:28] ;default: 3'b0 ; */

/* Description: This register stores the value of state machine to produce
 * SCL.
 * 3'h0: SCL_IDLE
 * 3'h1: SCL_START
 * 3'h2: SCL_LOW_EDGE
 * 3'h3: SCL_LOW
 * 3'h4: SCL_HIGH_EDGE
 * 3'h5: SCL_HIGH
 * 3'h6: SCL_STOP
 */

#define I2C_SCL_STATE_LAST      0x00000007
#define I2C_SCL_STATE_LAST_M    ((I2C_SCL_STATE_LAST_V)<<(I2C_SCL_STATE_LAST_S))
#define I2C_SCL_STATE_LAST_V    0x7
#define I2C_SCL_STATE_LAST_S    28

/* I2C_SCL_MAIN_STATE_LAST : RO ;bitpos:[26:24] ;default: 3'b0 ; */

