apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_i2c.h
/* Description: This register stores the value of state machine for i2c
 * module.
 * 3'h0: SCL_MAIN_IDLE
 * 3'h1: SCL_ADDRESS_SHIFT
 * 3'h2: SCL_ACK_ADDRESS
 * 3'h3: SCL_RX_DATA
 * 3'h4: SCL_TX_DATA
 * 3'h5: SCL_SEND_ACK
 * 3'h6: SCL_WAIT_ACK
 */

#define I2C_SCL_MAIN_STATE_LAST    0x00000007
#define I2C_SCL_MAIN_STATE_LAST_M  ((I2C_SCL_MAIN_STATE_LAST_V)<<(I2C_SCL_MAIN_STATE_LAST_S))
#define I2C_SCL_MAIN_STATE_LAST_V  0x7
#define I2C_SCL_MAIN_STATE_LAST_S  24

/* I2C_TXFIFO_CNT : RO ;bitpos:[23:18] ;default: 6'b0 ; */

/* Description: This register stores the amount of received data in ram. */

#define I2C_TXFIFO_CNT          0x0000003F
#define I2C_TXFIFO_CNT_M        ((I2C_TXFIFO_CNT_V)<<(I2C_TXFIFO_CNT_S))
#define I2C_TXFIFO_CNT_V        0x3F
#define I2C_TXFIFO_CNT_S        18

/* I2C_RXFIFO_CNT : RO ;bitpos:[13:8] ;default: 6'b0 ; */

/* Description: This register represent the amount of data need to send. */

#define I2C_RXFIFO_CNT          0x0000003F
#define I2C_RXFIFO_CNT_M        ((I2C_RXFIFO_CNT_V)<<(I2C_RXFIFO_CNT_S))
#define I2C_RXFIFO_CNT_V        0x3F
#define I2C_RXFIFO_CNT_S        8

/* I2C_BYTE_TRANS : RO ;bitpos:[6] ;default: 1'b0 ; */

/* Description: This register changes to high level when one byte is
 * transferred.
 */

#define I2C_BYTE_TRANS          (BIT(6))
#define I2C_BYTE_TRANS_M        (BIT(6))
#define I2C_BYTE_TRANS_V        0x1
#define I2C_BYTE_TRANS_S        6

/* I2C_SLAVE_ADDRESSED : RO ;bitpos:[5] ;default: 1'b0 ; */

/* Description: when configured as i2c slave  and the address send by master
 * is equal to slave's address  then this bit will be high level.
 */

#define I2C_SLAVE_ADDRESSED     (BIT(5))
#define I2C_SLAVE_ADDRESSED_M   (BIT(5))
#define I2C_SLAVE_ADDRESSED_V   0x1
#define I2C_SLAVE_ADDRESSED_S   5

/* I2C_BUS_BUSY : RO ;bitpos:[4] ;default: 1'b0 ; */

/* Description:
 * 1: I2C bus is busy transferring data.
 * 0: I2C bus is in idle state.
 */

#define I2C_BUS_BUSY            (BIT(4))
#define I2C_BUS_BUSY_M          (BIT(4))
#define I2C_BUS_BUSY_V          0x1
#define I2C_BUS_BUSY_S          4

/* I2C_ARB_LOST : RO ;bitpos:[3] ;default: 1'b0 ; */

/* Description: when I2C lost control of SDA line this register changes
 * to high level.
 */

#define I2C_ARB_LOST            (BIT(3))
#define I2C_ARB_LOST_M          (BIT(3))
#define I2C_ARB_LOST_V          0x1
#define I2C_ARB_LOST_S          3

/* I2C_TIME_OUT : RO ;bitpos:[2] ;default: 1'b0 ; */

/* Description: when I2C takes more than time_out_reg clocks to receive a
 * data then this register changes to high level.
 */

#define I2C_TIME_OUT            (BIT(2))
#define I2C_TIME_OUT_M          (BIT(2))
#define I2C_TIME_OUT_V          0x1
#define I2C_TIME_OUT_S          2

/* I2C_SLAVE_RW : RO ;bitpos:[1] ;default: 1'b0 ; */

/* Description: when in slave mode
 * 1: master read slave
 * 0: master write slave.
 */

#define I2C_SLAVE_RW            (BIT(1))
#define I2C_SLAVE_RW_M          (BIT(1))
#define I2C_SLAVE_RW_V          0x1
#define I2C_SLAVE_RW_S          1

/* I2C_ACK_REC : RO ;bitpos:[0] ;default: 1'b0 ; */

/* Description: This register stores the value of ACK bit. */

#define I2C_ACK_REC             (BIT(0))
#define I2C_ACK_REC_M           (BIT(0))
#define I2C_ACK_REC_V           0x1
#define I2C_ACK_REC_S           0

#define I2C_TO_OFFSET           (0x000c)
#define I2C_TO_REG(i)           (REG_I2C_BASE(i) + I2C_TO_OFFSET)

/* I2C_TIME_OUT_REG : R/W ;bitpos:[19:0] ;default: 20'b0 ; */

/* Description: This register is used to configure the max clock number of
 * receiving a data.
 */

#define I2C_TIME_OUT_REG        0x000FFFFF
#define I2C_TIME_OUT_REG_M      ((I2C_TIME_OUT_REG_V)<<(I2C_TIME_OUT_REG_S))
#define I2C_TIME_OUT_REG_V      0xFFFFF
#define I2C_TIME_OUT_REG_S      0

#define I2C_SLAVE_ADDR_OFFSET   (0x0010)
#define I2C_SLAVE_ADDR_REG(i)   (REG_I2C_BASE(i) + I2C_SLAVE_ADDR_OFFSET)

/* I2C_ADDR_10BIT_EN : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: This register is used to enable slave 10bit address mode. */

#define I2C_ADDR_10BIT_EN       (BIT(31))
#define I2C_ADDR_10BIT_EN_M     (BIT(31))
#define I2C_ADDR_10BIT_EN_V     0x1
#define I2C_ADDR_10BIT_EN_S     31

/* I2C_SLAVE_ADDR : R/W ;bitpos:[14:0] ;default: 15'b0 ; */

/* Description: when configured as i2c slave this register is used to
 * configure slave's address.
 */

#define I2C_SLAVE_ADDR          0x00007FFF
#define I2C_SLAVE_ADDR_M        ((I2C_SLAVE_ADDR_V)<<(I2C_SLAVE_ADDR_S))
#define I2C_SLAVE_ADDR_V        0x7FFF
#define I2C_SLAVE_ADDR_S        0

#define I2C_RXFIFO_ST_OFFSET    (0x0014)
#define I2C_RXFIFO_ST_REG(i)    (REG_I2C_BASE(i) + I2C_RXFIFO_ST_OFFSET)

/* I2C_TXFIFO_END_ADDR : RO ;bitpos:[19:15] ;default: 5'b0 ; */

/* Description: This is the offset address of the last sending data as
 * described in nonfifo_tx_thres register.
 */

#define I2C_TXFIFO_END_ADDR    0x0000001F
#define I2C_TXFIFO_END_ADDR_M  ((I2C_TXFIFO_END_ADDR_V)<<(I2C_TXFIFO_END_ADDR_S))
#define I2C_TXFIFO_END_ADDR_V  0x1F
#define I2C_TXFIFO_END_ADDR_S  15

/* I2C_TXFIFO_START_ADDR : RO ;bitpos:[14:10] ;default: 5'b0 ; */

/* Description: This is the offset address of the first sending data as
 * described in nonfifo_tx_thres register.
 */

#define I2C_TXFIFO_START_ADDR    0x0000001F
#define I2C_TXFIFO_START_ADDR_M  ((I2C_TXFIFO_START_ADDR_V)<<(I2C_TXFIFO_START_ADDR_S))
#define I2C_TXFIFO_START_ADDR_V  0x1F
#define I2C_TXFIFO_START_ADDR_S  10

/* I2C_RXFIFO_END_ADDR : RO ;bitpos:[9:5] ;default: 5'b0 ; */

/* Description: This is the offset address of the first receiving data as
 * described in nonfifo_rx_thres_register.
 */

#define I2C_RXFIFO_END_ADDR    0x0000001F
#define I2C_RXFIFO_END_ADDR_M  ((I2C_RXFIFO_END_ADDR_V)<<(I2C_RXFIFO_END_ADDR_S))
#define I2C_RXFIFO_END_ADDR_V  0x1F
#define I2C_RXFIFO_END_ADDR_S  5

/* I2C_RXFIFO_START_ADDR : RO ;bitpos:[4:0] ;default: 5'b0 ; */

/* Description: This is the offset address of the last receiving data as
 * described in nonfifo_rx_thres_register.
 */

#define I2C_RXFIFO_START_ADDR    0x0000001F
#define I2C_RXFIFO_START_ADDR_M  ((I2C_RXFIFO_START_ADDR_V)<<(I2C_RXFIFO_START_ADDR_S))
#define I2C_RXFIFO_START_ADDR_V  0x1F
#define I2C_RXFIFO_START_ADDR_S  0

#define I2C_FIFO_CONF_OFFSET    (0x0018)
#define I2C_FIFO_CONF_REG(i)    (REG_I2C_BASE(i) + I2C_FIFO_CONF_OFFSET)

/* I2C_NONFIFO_TX_THRES : R/W ;bitpos:[25:20] ;default: 6'h15 ; */

