apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_i2c.h
/* Description: when I2C sends more than nonfifo_tx_thres data it will
 * produce tx_send_empty_int_raw interrupt and update the current offset
 * address of the sending data.
 */

#define I2C_NONFIFO_TX_THRES    0x0000003F
#define I2C_NONFIFO_TX_THRES_M  ((I2C_NONFIFO_TX_THRES_V)<<(I2C_NONFIFO_TX_THRES_S))
#define I2C_NONFIFO_TX_THRES_V  0x3F
#define I2C_NONFIFO_TX_THRES_S  20

/* I2C_NONFIFO_RX_THRES : R/W ;bitpos:[19:14] ;default: 6'h15 ; */

/* Description: when I2C receives more than nonfifo_rx_thres data it will
 * produce rx_send_full_int_raw interrupt and update the current offset
 * address of the receiving data.
 */

#define I2C_NONFIFO_RX_THRES    0x0000003F
#define I2C_NONFIFO_RX_THRES_M  ((I2C_NONFIFO_RX_THRES_V)<<(I2C_NONFIFO_RX_THRES_S))
#define I2C_NONFIFO_RX_THRES_V  0x3F
#define I2C_NONFIFO_RX_THRES_S  14

/* I2C_TX_FIFO_RST : R/W ;bitpos:[13] ;default: 1'b0 ; */

/* Description: Set this bit to reset tx fifo when using apb fifo access. */

#define I2C_TX_FIFO_RST         (BIT(13))
#define I2C_TX_FIFO_RST_M       (BIT(13))
#define I2C_TX_FIFO_RST_V       0x1
#define I2C_TX_FIFO_RST_S       13

/* I2C_RX_FIFO_RST : R/W ;bitpos:[12] ;default: 1'b0 ; */

/* Description: Set this bit to reset rx fifo when using apb fifo access. */

#define I2C_RX_FIFO_RST         (BIT(12))
#define I2C_RX_FIFO_RST_M       (BIT(12))
#define I2C_RX_FIFO_RST_V       0x1
#define I2C_RX_FIFO_RST_S       12

/* I2C_FIFO_ADDR_CFG_EN : R/W ;bitpos:[11] ;default: 1'b0 ; */

/* Description: When this bit is set to 1 then the byte after address
 * represent the offset address of I2C Slave's ram.
 */

#define I2C_FIFO_ADDR_CFG_EN    (BIT(11))
#define I2C_FIFO_ADDR_CFG_EN_M  (BIT(11))
#define I2C_FIFO_ADDR_CFG_EN_V  0x1
#define I2C_FIFO_ADDR_CFG_EN_S  11

/* I2C_NONFIFO_EN : R/W ;bitpos:[10] ;default: 1'b0 ; */

/* Description: Set this bit to enable apb nonfifo access. */

#define I2C_NONFIFO_EN          (BIT(10))
#define I2C_NONFIFO_EN_M        (BIT(10))
#define I2C_NONFIFO_EN_V        0x1
#define I2C_NONFIFO_EN_S        10

/* I2C_TXFIFO_EMPTY_THRHD : R/W ;bitpos:[9:5] ;default: 5'h4 ; */

/* Description: Config txfifo empty threhd value when using apb fifo access */

#define I2C_TXFIFO_EMPTY_THRHD    0x0000001F
#define I2C_TXFIFO_EMPTY_THRHD_M  ((I2C_TXFIFO_EMPTY_THRHD_V)<<(I2C_TXFIFO_EMPTY_THRHD_S))
#define I2C_TXFIFO_EMPTY_THRHD_V  0x1F
#define I2C_TXFIFO_EMPTY_THRHD_S  5

/* I2C_RXFIFO_FULL_THRHD : R/W ;bitpos:[4:0] ;default: 5'hb ; */

/* Description: */

#define I2C_RXFIFO_FULL_THRHD    0x0000001F
#define I2C_RXFIFO_FULL_THRHD_M  ((I2C_RXFIFO_FULL_THRHD_V)<<(I2C_RXFIFO_FULL_THRHD_S))
#define I2C_RXFIFO_FULL_THRHD_V  0x1F
#define I2C_RXFIFO_FULL_THRHD_S  0

#define I2C_DATA_APB_REG(i)     (0x60013000 + (i) * 0x14000 + 0x001c)

#define I2C_DATA_OFFSET         (0x001c)
#define I2C_DATA_REG(i)         (REG_I2C_BASE(i) + I2C_DATA_OFFSET)

/* I2C_FIFO_RDATA : RO ;bitpos:[7:0] ;default: 8'b0 ; */

/* Description: The register represent the byte data read from rxfifo when
 * use apb fifo access.
 */

#define I2C_FIFO_RDATA          0x000000FF
#define I2C_FIFO_RDATA_M        ((I2C_FIFO_RDATA_V)<<(I2C_FIFO_RDATA_S))
#define I2C_FIFO_RDATA_V        0xFF
#define I2C_FIFO_RDATA_S        0

#define I2C_INT_RAW_OFFSET      (0x0020)
#define I2C_INT_RAW_REG(i)      (REG_I2C_BASE(i) + I2C_INT_RAW_OFFSET)

/* I2C_TX_SEND_EMPTY_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */

/* Description: The raw interrupt status bit for tx_send_empty_int interrupt.
 * When I2C sends more data than nonfifo_tx_thres it will produce
 * tx_send_empty_int interrupt.
 */

#define I2C_TX_SEND_EMPTY_INT_RAW    (BIT(12))
#define I2C_TX_SEND_EMPTY_INT_RAW_M  (BIT(12))
#define I2C_TX_SEND_EMPTY_INT_RAW_V  0x1
#define I2C_TX_SEND_EMPTY_INT_RAW_S  12

/* I2C_RX_REC_FULL_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */

/* Description: The raw interrupt status bit for rx_rec_full_int interrupt.
 * When I2C receives more data than nonfifo_rx_thres it will produce
 * rx_rec_full_int interrupt.
 */

#define I2C_RX_REC_FULL_INT_RAW    (BIT(11))
#define I2C_RX_REC_FULL_INT_RAW_M  (BIT(11))
#define I2C_RX_REC_FULL_INT_RAW_V  0x1
#define I2C_RX_REC_FULL_INT_RAW_S  11

/* I2C_ACK_ERR_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */

/* Description: The raw interrupt status bit for ack_err_int interrupt.
 * When I2C receives a wrong ACK bit  it will produce ack_err_int
 * interrupt.
 */

#define I2C_ACK_ERR_INT_RAW     (BIT(10))
#define I2C_ACK_ERR_INT_RAW_M   (BIT(10))
#define I2C_ACK_ERR_INT_RAW_V   0x1
#define I2C_ACK_ERR_INT_RAW_S   10

/* I2C_TRANS_START_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */

/* Description: The raw interrupt status bit for trans_start_int interrupt.
 * When I2C sends the START bit it will produce trans_start_int interrupt.
 */

#define I2C_TRANS_START_INT_RAW    (BIT(9))
#define I2C_TRANS_START_INT_RAW_M  (BIT(9))
#define I2C_TRANS_START_INT_RAW_V  0x1
#define I2C_TRANS_START_INT_RAW_S  9

/* I2C_TIME_OUT_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */

/* Description: The raw interrupt status bit for time_out_int interrupt.
 * When I2C takes a lot of time to receive a data  it will produce
 * time_out_int interrupt.
 */

#define I2C_TIME_OUT_INT_RAW    (BIT(8))
#define I2C_TIME_OUT_INT_RAW_M  (BIT(8))
#define I2C_TIME_OUT_INT_RAW_V  0x1
#define I2C_TIME_OUT_INT_RAW_S  8

/* I2C_TRANS_COMPLETE_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */

/* Description: The raw interrupt status bit for trans_complete_int
 * interrupt. When I2C Master finished STOP command it will produce
 * trans_complete_int interrupt.
 */

#define I2C_TRANS_COMPLETE_INT_RAW    (BIT(7))
#define I2C_TRANS_COMPLETE_INT_RAW_M  (BIT(7))
#define I2C_TRANS_COMPLETE_INT_RAW_V  0x1
#define I2C_TRANS_COMPLETE_INT_RAW_S  7

/* I2C_MASTER_TRAN_COMP_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */

/* Description: The raw interrupt status bit for master_tra_comp_int
 * interrupt. When I2C Master sends or receives a byte it will produce
 * master_tran_comp_int interrupt.
 */

#define I2C_MASTER_TRAN_COMP_INT_RAW   (BIT(6))
#define I2C_MASTER_TRAN_COMP_INT_RAW_M  (BIT(6))
#define I2C_MASTER_TRAN_COMP_INT_RAW_V  0x1
#define I2C_MASTER_TRAN_COMP_INT_RAW_S  6

/* I2C_ARBITRATION_LOST_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */

