apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_i2c.h
/* I2C_SLAVE_TRAN_COMP_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */

/* Description: The masked interrupt status for slave_tran_comp_int
 * interrupt.
 */

#define I2C_SLAVE_TRAN_COMP_INT_ST    (BIT(4))
#define I2C_SLAVE_TRAN_COMP_INT_ST_M  (BIT(4))
#define I2C_SLAVE_TRAN_COMP_INT_ST_V  0x1
#define I2C_SLAVE_TRAN_COMP_INT_ST_S  4

/* I2C_END_DETECT_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */

/* Description: The masked interrupt status for end_detect_int interrupt. */

#define I2C_END_DETECT_INT_ST    (BIT(3))
#define I2C_END_DETECT_INT_ST_M  (BIT(3))
#define I2C_END_DETECT_INT_ST_V  0x1
#define I2C_END_DETECT_INT_ST_S  3

/* I2C_RXFIFO_OVF_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */

/* Description: The masked interrupt status for rxfifo_ovf_int interrupt. */

#define I2C_RXFIFO_OVF_INT_ST    (BIT(2))
#define I2C_RXFIFO_OVF_INT_ST_M  (BIT(2))
#define I2C_RXFIFO_OVF_INT_ST_V  0x1
#define I2C_RXFIFO_OVF_INT_ST_S  2

/* I2C_TXFIFO_EMPTY_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */

/* Description: The masked interrupt status for txfifo_empty_int interrupt. */

#define I2C_TXFIFO_EMPTY_INT_ST    (BIT(1))
#define I2C_TXFIFO_EMPTY_INT_ST_M  (BIT(1))
#define I2C_TXFIFO_EMPTY_INT_ST_V  0x1
#define I2C_TXFIFO_EMPTY_INT_ST_S  1

/* I2C_RXFIFO_FULL_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */

/* Description: The masked interrupt status for rxfifo_full_int interrupt. */

#define I2C_RXFIFO_FULL_INT_ST    (BIT(0))
#define I2C_RXFIFO_FULL_INT_ST_M  (BIT(0))
#define I2C_RXFIFO_FULL_INT_ST_V  0x1
#define I2C_RXFIFO_FULL_INT_ST_S  0

#define I2C_SDA_HOLD_OFFSET     (0x0030)
#define I2C_SDA_HOLD_REG(i)     (REG_I2C_BASE(i) + I2C_SDA_HOLD_OFFSET)

/* I2C_SDA_HOLD_TIME : R/W ;bitpos:[9:0] ;default: 10'b0 ; */

/* Description: This register is used to configure the clock num I2C used to
 * hold the data after the negedge of SCL.
 */

#define I2C_SDA_HOLD_TIME       0x000003FF
#define I2C_SDA_HOLD_TIME_M     ((I2C_SDA_HOLD_TIME_V)<<(I2C_SDA_HOLD_TIME_S))
#define I2C_SDA_HOLD_TIME_V     0x3FF
#define I2C_SDA_HOLD_TIME_S     0

#define I2C_SDA_SAMPLE_OFFSET   (0x0034)
#define I2C_SDA_SAMPLE_REG(i)   (REG_I2C_BASE(i) + I2C_SDA_SAMPLE_OFFSET)

/* I2C_SDA_SAMPLE_TIME : R/W ;bitpos:[9:0] ;default: 10'b0 ; */

/* Description: This register is used to configure the clock num I2C used to
 * sample data on SDA after the posedge of SCL
 */

#define I2C_SDA_SAMPLE_TIME    0x000003FF
#define I2C_SDA_SAMPLE_TIME_M  ((I2C_SDA_SAMPLE_TIME_V)<<(I2C_SDA_SAMPLE_TIME_S))
#define I2C_SDA_SAMPLE_TIME_V  0x3FF
#define I2C_SDA_SAMPLE_TIME_S  0

#define I2C_SCL_HIGH_PERIOD_OFFSET       (0x0038)
#define I2C_SCL_HIGH_PERIOD_REG(i)       (REG_I2C_BASE(i) + I2C_SCL_HIGH_PERIOD_OFFSET)

/* I2C_SCL_HIGH_PERIOD : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This register is used to configure the clock num during SCL
 * is low level.
 */

#define I2C_SCL_HIGH_PERIOD    0x00003FFF
#define I2C_SCL_HIGH_PERIOD_M  ((I2C_SCL_HIGH_PERIOD_V)<<(I2C_SCL_HIGH_PERIOD_S))
#define I2C_SCL_HIGH_PERIOD_V  0x3FFF
#define I2C_SCL_HIGH_PERIOD_S  0

#define I2C_SCL_START_HOLD_OFFSET        (0x0040)
#define I2C_SCL_START_HOLD_REG(i)        (REG_I2C_BASE(i) + I2C_SCL_START_HOLD_OFFSET)

/* I2C_SCL_START_HOLD_TIME : R/W ;bitpos:[9:0] ;default: 10'b1000 ; */

/* Description: This register is used to configure the clock num between the
 * negedge of SDA and negedge of SCL for start mark.
 */

#define I2C_SCL_START_HOLD_TIME    0x000003FF
#define I2C_SCL_START_HOLD_TIME_M  ((I2C_SCL_START_HOLD_TIME_V)<<(I2C_SCL_START_HOLD_TIME_S))
#define I2C_SCL_START_HOLD_TIME_V  0x3FF
#define I2C_SCL_START_HOLD_TIME_S  0

#define I2C_SCL_RSTART_SETUP_OFFSET      (0x0044)
#define I2C_SCL_RSTART_SETUP_REG(i)      (REG_I2C_BASE(i) + I2C_SCL_RSTART_SETUP_OFFSET)

/* I2C_SCL_RSTART_SETUP_TIME : R/W ;bitpos:[9:0] ;default: 10'b1000 ; */

/* Description: This register is used to configure the clock num between the
 * posedge of SCL and the negedge of SDA for restart mark.
 */

#define I2C_SCL_RSTART_SETUP_TIME    0x000003FF
#define I2C_SCL_RSTART_SETUP_TIME_M  ((I2C_SCL_RSTART_SETUP_TIME_V)<<(I2C_SCL_RSTART_SETUP_TIME_S))
#define I2C_SCL_RSTART_SETUP_TIME_V  0x3FF
#define I2C_SCL_RSTART_SETUP_TIME_S  0

#define I2C_SCL_STOP_HOLD_OFFSET         (0x0048)
#define I2C_SCL_STOP_HOLD_REG(i)         (REG_I2C_BASE(i) + I2C_SCL_STOP_HOLD_OFFSET)

/* I2C_SCL_STOP_HOLD_TIME : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This register is used to configure the clock num after the
 * STOP bit's posedge.
 */

#define I2C_SCL_STOP_HOLD_TIME    0x00003FFF
#define I2C_SCL_STOP_HOLD_TIME_M  ((I2C_SCL_STOP_HOLD_TIME_V)<<(I2C_SCL_STOP_HOLD_TIME_S))
#define I2C_SCL_STOP_HOLD_TIME_V  0x3FFF
#define I2C_SCL_STOP_HOLD_TIME_S  0

#define I2C_SCL_STOP_SETUP_OFFSET        (0x004C)
#define I2C_SCL_STOP_SETUP_REG(i)        (REG_I2C_BASE(i) + I2C_SCL_STOP_SETUP_OFFSET)

/* I2C_SCL_STOP_SETUP_TIME : R/W ;bitpos:[9:0] ;default: 10'b0 ; */

/* Description: This register is used to configure the clock num between the
 * posedge of SCL and the posedge of SDA.
 */

#define I2C_SCL_STOP_SETUP_TIME    0x000003FF
#define I2C_SCL_STOP_SETUP_TIME_M  ((I2C_SCL_STOP_SETUP_TIME_V)<<(I2C_SCL_STOP_SETUP_TIME_S))
#define I2C_SCL_STOP_SETUP_TIME_V  0x3FF
#define I2C_SCL_STOP_SETUP_TIME_S  0

#define I2C_SCL_FILTER_CFG_OFFSET        (0x0050)
#define I2C_SCL_FILTER_CFG_REG(i)        (REG_I2C_BASE(i) + I2C_SCL_FILTER_CFG_OFFSET)

/* I2C_SCL_FILTER_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */

/* Description: This is the filter enable bit for SCL. */

#define I2C_SCL_FILTER_EN       (BIT(3))
#define I2C_SCL_FILTER_EN_M     (BIT(3))
#define I2C_SCL_FILTER_EN_V     0x1
#define I2C_SCL_FILTER_EN_S     3

/* I2C_SCL_FILTER_THRES : R/W ;bitpos:[2:0] ;default: 3'b0 ; */

/* Description: When input SCL's pulse width is smaller than this register
 * value I2C ignores this pulse.
 */

#define I2C_SCL_FILTER_THRES    0x00000007
#define I2C_SCL_FILTER_THRES_M  ((I2C_SCL_FILTER_THRES_V)<<(I2C_SCL_FILTER_THRES_S))
#define I2C_SCL_FILTER_THRES_V  0x7
#define I2C_SCL_FILTER_THRES_S  0

