apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_i2c.h
#define I2C_SDA_FILTER_CFG_OFFSET        (0x0054)
#define I2C_SDA_FILTER_CFG_REG(i)        (REG_I2C_BASE(i) + I2C_SDA_FILTER_CFG_OFFSET)

/* I2C_SDA_FILTER_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */

/* Description: This is the filter enable bit for SDA. */

#define I2C_SDA_FILTER_EN       (BIT(3))
#define I2C_SDA_FILTER_EN_M     (BIT(3))
#define I2C_SDA_FILTER_EN_V     0x1
#define I2C_SDA_FILTER_EN_S     3

/* I2C_SDA_FILTER_THRES : R/W ;bitpos:[2:0] ;default: 3'b0 ; */

/* Description: When input SCL's pulse width is smaller than this register
 * value I2C ignores this pulse.
 */

#define I2C_SDA_FILTER_THRES    0x00000007
#define I2C_SDA_FILTER_THRES_M  ((I2C_SDA_FILTER_THRES_V)<<(I2C_SDA_FILTER_THRES_S))
#define I2C_SDA_FILTER_THRES_V  0x7
#define I2C_SDA_FILTER_THRES_S  0

#define I2C_COMD0_OFFSET        (0x0058)
#define I2C_COMD0_REG(i)        (REG_I2C_BASE(i) + I2C_COMD0_OFFSET)

/* I2C_COMMAND0_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command0 is done in I2C Master mode this bit changes to
 * high level.
 */

#define I2C_COMMAND0_DONE       (BIT(31))
#define I2C_COMMAND0_DONE_M     (BIT(31))
#define I2C_COMMAND0_DONE_V     0x1
#define I2C_COMMAND0_DONE_S     31

/* I2C_COMMAND0 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This is the content of command0. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4: END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en  ack_exp and ack value are used to control the ack
 * bit.
 */

#define I2C_COMMAND             0  0x00003FFF
#define I2C_COMMAND0_M          ((I2C_COMMAND0_V)<<(I2C_COMMAND0_S))
#define I2C_COMMAND0_V          0x3FFF
#define I2C_COMMAND0_S          0

#define I2C_COMD1_OFFSET        (0x005C)
#define I2C_COMD1_REG(i)        (REG_I2C_BASE(i) + I2C_COMD1_OFFSET)

/* I2C_COMMAND1_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command1 is done in I2C Master mode this bit changes to
 * high level.
 */

#define I2C_COMMAND1_DONE       (BIT(31))
#define I2C_COMMAND1_DONE_M     (BIT(31))
#define I2C_COMMAND1_DONE_V     0x1
#define I2C_COMMAND1_DONE_S     31

/* I2C_COMMAND1 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This is the content of command1. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4: END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en  ack_exp and ack value are used to control the ack
 * bit.
 */

#define I2C_COMMAND1            0x00003FFF
#define I2C_COMMAND1_M          ((I2C_COMMAND1_V)<<(I2C_COMMAND1_S))
#define I2C_COMMAND1_V          0x3FFF
#define I2C_COMMAND1_S          0

#define I2C_COMD2_OFFSET          (0x0060)
#define I2C_COMD2_REG(i)          (REG_I2C_BASE(i) + I2C_COMD2_OFFSET)

/* I2C_COMMAND2_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command2 is done in I2C Master mode  this bit changes to
 * high level.
 */

#define I2C_COMMAND2_DONE       (BIT(31))
#define I2C_COMMAND2_DONE_M     (BIT(31))
#define I2C_COMMAND2_DONE_V     0x1
#define I2C_COMMAND2_DONE_S     31

/* I2C_COMMAND2 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This is the content of command2. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4:END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en ack_exp and ack value are used to control the ack
 * bit.
 */

#define I2C_COMMAND2            0x00003FFF
#define I2C_COMMAND2_M          ((I2C_COMMAND2_V)<<(I2C_COMMAND2_S))
#define I2C_COMMAND2_V          0x3FFF
#define I2C_COMMAND2_S          0

#define I2C_COMD3_OFFSET          (0x0064)
#define I2C_COMD3_REG(i)          (REG_I2C_BASE(i) + I2C_COMD3_OFFSET)

/* I2C_COMMAND3_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command3 is done in I2C Master mode this bit changes to
 * high level.
 */

#define I2C_COMMAND3_DONE       (BIT(31))
#define I2C_COMMAND3_DONE_M     (BIT(31))
#define I2C_COMMAND3_DONE_V     0x1
#define I2C_COMMAND3_DONE_S     31

/* I2C_COMMAND3 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This is the content of command3. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4:END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en ack_exp and ack value are used to control the ack
 * bit.
 */

#define I2C_COMMAND3            0x00003FFF
#define I2C_COMMAND3_M          ((I2C_COMMAND3_V)<<(I2C_COMMAND3_S))
#define I2C_COMMAND3_V          0x3FFF
#define I2C_COMMAND3_S          0

#define I2C_COMD4_OFFSET        (0x0068)
#define I2C_COMD4_REG(i)        (REG_I2C_BASE(i) + I2C_COMD4_OFFSET)

/* I2C_COMMAND4_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command4 is done in I2C Master mode this bit changes to
 * high level.
 */

#define I2C_COMMAND4_DONE       (BIT(31))
#define I2C_COMMAND4_DONE_M     (BIT(31))
#define I2C_COMMAND4_DONE_V     0x1
#define I2C_COMMAND4_DONE_S     31

/* I2C_COMMAND4 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This is the content of command4. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4:END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en ack_exp and ack value are used to control the ack
 * bit.
 */

#define I2C_COMMAND4            0x00003FFF
#define I2C_COMMAND4_M          ((I2C_COMMAND4_V)<<(I2C_COMMAND4_S))
#define I2C_COMMAND4_V          0x3FFF
#define I2C_COMMAND4_S          0

#define I2C_COMD5_OFFSET        (0x006C)
#define I2C_COMD5_REG(i)        (REG_I2C_BASE(i) + I2C_COMD5_OFFSET)

/* I2C_COMMAND5_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command5 is done in I2C Master mode this bit changes
 * to high level.
 */

#define I2C_COMMAND5_DONE       (BIT(31))
#define I2C_COMMAND5_DONE_M     (BIT(31))
#define I2C_COMMAND5_DONE_V     0x1
#define I2C_COMMAND5_DONE_S     31

/* I2C_COMMAND5 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

