apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_i2c.h
/* Description: This is the content of command5. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4:END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en ack_exp and ack value are used to control the ack
 * bit.
 */

#define I2C_COMMAND5            0x00003FFF
#define I2C_COMMAND5_M          ((I2C_COMMAND5_V)<<(I2C_COMMAND5_S))
#define I2C_COMMAND5_V          0x3FFF
#define I2C_COMMAND5_S          0

#define I2C_COMD6_OFFSET        (0x0070)
#define I2C_COMD6_REG(i)        (REG_I2C_BASE(i) + I2C_COMD6_OFFSET)

/* I2C_COMMAND6_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command6 is done in I2C Master mode this bit changes
 * to high level.
 */

#define I2C_COMMAND6_DONE       (BIT(31))
#define I2C_COMMAND6_DONE_M     (BIT(31))
#define I2C_COMMAND6_DONE_V     0x1
#define I2C_COMMAND6_DONE_S     31

/* I2C_COMMAND6 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This is the content of command6. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4:END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en  ack_exp and ack value are used to control the ack
 * bit.
 */

#define I2C_COMMAND6            0x00003FFF
#define I2C_COMMAND6_M          ((I2C_COMMAND6_V)<<(I2C_COMMAND6_S))
#define I2C_COMMAND6_V          0x3FFF
#define I2C_COMMAND6_S          0

#define I2C_COMD7_OFFSET          (0x0074)
#define I2C_COMD7_REG(i)          (REG_I2C_BASE(i) + I2C_COMD7_OFFSET)

/* I2C_COMMAND7_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command7 is done in I2C Master mode this bit changes to
 * high level.
 */

#define I2C_COMMAND7_DONE       (BIT(31))
#define I2C_COMMAND7_DONE_M     (BIT(31))
#define I2C_COMMAND7_DONE_V     0x1
#define I2C_COMMAND7_DONE_S     31

/* I2C_COMMAND7 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This is the content of command7. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4:END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en  ack_exp and ack value are used to control the ack
 * bit.
 */

#define I2C_COMMAND7            0x00003FFF
#define I2C_COMMAND7_M          ((I2C_COMMAND7_V)<<(I2C_COMMAND7_S))
#define I2C_COMMAND7_V          0x3FFF
#define I2C_COMMAND7_S          0

#define I2C_COMD8_OFFSET        (0x0078)
#define I2C_COMD8_REG(i)        (REG_I2C_BASE(i) + I2C_COMD8_OFFSET)

/* I2C_COMMAND8_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command8 is done in I2C Master mode this bit changes to
 * high level.
 */

#define I2C_COMMAND8_DONE       (BIT(31))
#define I2C_COMMAND8_DONE_M     (BIT(31))
#define I2C_COMMAND8_DONE_V     0x1
#define I2C_COMMAND8_DONE_S     31

/* I2C_COMMAND8 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This is the content of command8. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4: END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en  ack_exp and ack value are used to control the ack
 * bit.
 */

#define I2C_COMMAND8            0x00003FFF
#define I2C_COMMAND8_M          ((I2C_COMMAND8_V)<<(I2C_COMMAND8_S))
#define I2C_COMMAND8_V          0x3FFF
#define I2C_COMMAND8_S          0

#define I2C_COMD9_OFFSET          (0x007C)
#define I2C_COMD9_REG(i)          (REG_I2C_BASE(i) + I2C_COMD9_OFFSET)

/* I2C_COMMAND9_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command9 is done in I2C Master mode this bit changes to
 * high level.
 */

#define I2C_COMMAND9_DONE       (BIT(31))
#define I2C_COMMAND9_DONE_M     (BIT(31))
#define I2C_COMMAND9_DONE_V     0x1
#define I2C_COMMAND9_DONE_S     31

/* I2C_COMMAND9 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This is the content of command9. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4:END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en  ack_exp and ack value are used to control the ack
 * bit.
 */

#define I2C_COMMAND9            0x00003FFF
#define I2C_COMMAND9_M          ((I2C_COMMAND9_V)<<(I2C_COMMAND9_S))
#define I2C_COMMAND9_V          0x3FFF
#define I2C_COMMAND9_S          0

#define I2C_COMD10_OFFSET       (0x0080)
#define I2C_COMD10_REG(i)       (REG_I2C_BASE(i) + I2C_COMD10_OFFSET)

/* I2C_COMMAND10_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command10 is done in I2C Master mode this bit changes
 * to high level.
 */

#define I2C_COMMAND10_DONE      (BIT(31))
#define I2C_COMMAND10_DONE_M    (BIT(31))
#define I2C_COMMAND10_DONE_V    0x1
#define I2C_COMMAND10_DONE_S    31

/* I2C_COMMAND10 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This is the content of command10. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4:END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en  ack_exp and ack value are used to control the ack
 * bit.
 */

#define I2C_COMMAND10           0x00003FFF
#define I2C_COMMAND10_M         ((I2C_COMMAND10_V)<<(I2C_COMMAND10_S))
#define I2C_COMMAND10_V         0x3FFF
#define I2C_COMMAND10_S         0

#define I2C_COMD11_OFFSET          (0x0084)
#define I2C_COMD11_REG(i)          (REG_I2C_BASE(i) + I2C_COMD11_OFFSET)

/* I2C_COMMAND11_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command11 is done in I2C Master mode this bit changes
 * to high level.
 */

#define I2C_COMMAND11_DONE      (BIT(31))
#define I2C_COMMAND11_DONE_M    (BIT(31))
#define I2C_COMMAND11_DONE_V    0x1
#define I2C_COMMAND11_DONE_S    31

/* I2C_COMMAND11 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This is the content of command11. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4:END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en  ack_exp and ack value are used to control the ack
 * bit.
 */

