apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_i2c.h
#define I2C_COMMAND11           0x00003FFF
#define I2C_COMMAND11_M         ((I2C_COMMAND11_V)<<(I2C_COMMAND11_S))
#define I2C_COMMAND11_V         0x3FFF
#define I2C_COMMAND11_S         0

#define I2C_COMD12_OFFSET       (0x0088)
#define I2C_COMD12_REG          (i)  (REG_I2C_BASE(i) + I2C_COMD12_OFFSET)

/* I2C_COMMAND12_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command12 is done in I2C Master mode this bit changes
 * to high level.
 */

#define I2C_COMMAND12_DONE      (BIT(31))
#define I2C_COMMAND12_DONE_M    (BIT(31))
#define I2C_COMMAND12_DONE_V    0x1
#define I2C_COMMAND12_DONE_S    31

/* I2C_COMMAND12 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This is the content of command12. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4:END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en  ack_exp and ack value are used to control the ack
 * bit.
 */

#define I2C_COMMAND12           0x00003FFF
#define I2C_COMMAND12_M         ((I2C_COMMAND12_V)<<(I2C_COMMAND12_S))
#define I2C_COMMAND12_V         0x3FFF
#define I2C_COMMAND12_S         0

#define I2C_COMD13_OFFSET       (0x008C)
#define I2C_COMD13_REG          (i)  (REG_I2C_BASE(i) + I2C_COMD13_OFFSET)

/* I2C_COMMAND13_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command13 is done in I2C Master mode this bit changes
 * to high level.
 */

#define I2C_COMMAND13_DONE      (BIT(31))
#define I2C_COMMAND13_DONE_M    (BIT(31))
#define I2C_COMMAND13_DONE_V    0x1
#define I2C_COMMAND13_DONE_S    31

/* I2C_COMMAND13 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This is the content of command13. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4:END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en  ack_exp and ack value are used to control the ack
 * bit.
 */

#define I2C_COMMAND13           0x00003FFF
#define I2C_COMMAND13_M         ((I2C_COMMAND13_V)<<(I2C_COMMAND13_S))
#define I2C_COMMAND13_V         0x3FFF
#define I2C_COMMAND13_S         0

#define I2C_COMD14_OFFSET       (0x0090)
#define I2C_COMD14_REG          (i)  (REG_I2C_BASE(i) + I2C_COMD14_OFFSET)

/* I2C_COMMAND14_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command14 is done in I2C Master mode this bit changes
 * to high level.
 */

#define I2C_COMMAND14_DONE      (BIT(31))
#define I2C_COMMAND14_DONE_M    (BIT(31))
#define I2C_COMMAND14_DONE_V    0x1
#define I2C_COMMAND14_DONE_S    31

/* I2C_COMMAND14 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This is the content of command14. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4:END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en  ack_exp and ack value are used to control the ack
 * bit.
 */

#define I2C_COMMAND14           0x00003FFF
#define I2C_COMMAND14_M         ((I2C_COMMAND14_V)<<(I2C_COMMAND14_S))
#define I2C_COMMAND14_V         0x3FFF
#define I2C_COMMAND14_S         0

#define I2C_COMD15_OFFSET       (0x0094)
#define I2C_COMD15_REG          (i)  (REG_I2C_BASE(i) + I2C_COMD15_OFFSET)

/* I2C_COMMAND15_DONE : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When command15 is done in I2C Master mode this bit changes
 * to high level.
 */

#define I2C_COMMAND15_DONE      (BIT(31))
#define I2C_COMMAND15_DONE_M    (BIT(31))
#define I2C_COMMAND15_DONE_V    0x1
#define I2C_COMMAND15_DONE_S    31

/* I2C_COMMAND15 : R/W ;bitpos:[13:0] ;default: 14'b0 ; */

/* Description: This is the content of command15. It consists of three part.
 * op_code is the command
 * 0: RSTART
 * 1: WRITE
 * 2: READ
 * 3: STOP
 * 4:END.
 * Byte_num represent the number of data need to be send or data need to be
 * received. ack_check_en  ack_exp and ack value are used to control
 * the ack bit.
 */

#define I2C_COMMAND15           0x00003FFF
#define I2C_COMMAND15_M         ((I2C_COMMAND15_V)<<(I2C_COMMAND15_S))
#define I2C_COMMAND15_V         0x3FFF
#define I2C_COMMAND15_S         0

#define I2C_DATE_OFFSET         (0x00F8)
#define I2C_DATE_REG            (i)  (REG_I2C_BASE(i) + I2C_DATE_OFFSET)

/* I2C_DATE : R/W ;bitpos:[31:0] ;default: 32'h16042000 ; */

/* Description: */

#define I2C_DATE                0xFFFFFFFF
#define I2C_DATE_M              ((I2C_DATE_V)<<(I2C_DATE_S))
#define I2C_DATE_V              0xFFFFFFFF
#define I2C_DATE_S              0

#define I2C_FIFO_START_ADDR_OFFSET    (0x0100)
#define I2C_FIFO_START_ADDR_REG(i)    (REG_I2C_BASE(i) + I2C_FIFO_START_ADDR_OFFSET)

#endif /* __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_I2C_H */
